# pandas modulü

pandas, dataframe leri kullanmak için hızlı ve etkilidir. Avantajları: array' ler tek boyutlu dizilerdir. DataFrame'ler ise çok boyutlu dizilerdir. Özellikleri ve avantajları: 

1- Çeşitli veri sütunlarından oluşan MS Excel dosyası yapısındaki yapılar DataFrame' lerdir. 

2- csv (comma seperated values) ya da text dosyası gibi dosyalardaki verileri açıp bu dosyalardan çekilen veriler üzerine işlemler yapıp daha sonra tekrar bu dosya türlerine dönüşüm yapılabilir. 

3- data içinde missing value' lar olabilir. Örneğin bir işletmedeki personelin maaşları, çalışma yılları, kadro dereceleri gibi bilgilerin olduğu bir veri tablosunda baz ıpersonelin maaşlarının unutulduğunu düşünelim. Bu unutulan değerler missin value' dur. Missing value' lar ile çalışmak için pandas oldukça pratik yollar sağlamaktadır. 

4- datayı reshape yaparak datayı daha etkili bir şekilde kullanmak mümkündür. 

5- slicing ve indexing işlemleri oldukça kolaydır. 

6- Time Series (zamana bağlı olarak değişen datalar) data analizinde oldukça yardımcıdır. 

7- Hız açısından optimize edilmiş, hızlı bir kütüphanedir. 

Bu özellikleri ile Makine Öğrenmesinde gerekli olan en önemli kütüphanedir.

In [1]:
import pandas as pd # pandas' ın import edilmesi

In [2]:
dictionary = {"İSİM": ["Kaan", "Murat", "Andrew", "Mikail", "Natalie", "Brooke", "Sandra", "Adriana"],
             "YAŞ": [24, 24, 40, 28, 28, 32, 34, 35],
             "MAAS": [10000, 10000, 40000, 18000, 12000, 24000, 24000, 30000]}
dictionary

{'İSİM': ['Kaan',
  'Murat',
  'Andrew',
  'Mikail',
  'Natalie',
  'Brooke',
  'Sandra',
  'Adriana'],
 'YAŞ': [24, 24, 40, 28, 28, 32, 34, 35],
 'MAAS': [10000, 10000, 40000, 18000, 12000, 24000, 24000, 30000]}

In [3]:
dataframe1 = pd.DataFrame(dictionary)
dataframe1

      İSİM  YAŞ   MAAS
0     Kaan   24  10000
1    Murat   24  10000
2   Andrew   40  40000
3   Mikail   28  18000
4  Natalie   28  12000
5   Brooke   32  24000
6   Sandra   34  24000
7  Adriana   35  30000

# .head()

Dataframe içindeki ilk 5 satırı ekrana yazdırır. Özellikle datanın bir dış dosyadan aktarıldığı durumlarda ve data binlerce onbinlerce veri içerdiği durumlarda datanın iiçnde neler olduğunu görmek amacıyla yani bir ön inceleme amacıyla faydalıdır.

In [4]:
dataframe1.head()

      İSİM  YAŞ   MAAS
0     Kaan   24  10000
1    Murat   24  10000
2   Andrew   40  40000
3   Mikail   28  18000
4  Natalie   28  12000

# .tail()

Bu metot da dataframe içindeki son beş satırın görüntülenmesini sağlar. Yine ön inceleme için kullanılabilir.

In [5]:
dataframe1.tail()

      İSİM  YAŞ   MAAS
3   Mikail   28  18000
4  Natalie   28  12000
5   Brooke   32  24000
6   Sandra   34  24000
7  Adriana   35  30000

In [6]:
dataframe1.head(7) # ilk 7 satırı görmek amacıyla parametre olarak verilir.

      İSİM  YAŞ   MAAS
0     Kaan   24  10000
1    Murat   24  10000
2   Andrew   40  40000
3   Mikail   28  18000
4  Natalie   28  12000
5   Brooke   32  24000
6   Sandra   34  24000

# pandas basic

In [7]:
dataframe1.columns

Index(['İSİM', 'YAŞ', 'MAAS'], dtype='object')

In [8]:
dataframe1.info() # dataframe hakkında bilgi verir. 

# object yeni bir veri tipi dğeildir, string e eşdeğerdir.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   İSİM    8 non-null      object
 1   YAŞ     8 non-null      int64
 2   MAAS    8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

In [9]:
dataframe1.dtypes # sütunların veri tipini yazdırır.

İSİM    object
YAŞ      int64
MAAS     int64
dtype: object

In [10]:
dataframe1.describe() #artık yavaş yavaş data analizine giriyoruz. 

# describe, sadece nümerik yani sayısal feature (özellik-öznitelik) leri alır.

             YAŞ          MAAS
count   8.000000      8.000000
mean   30.625000  21000.000000
std     5.629958  10636.863125
min    24.000000  10000.000000
25%    27.000000  11500.000000
50%    30.000000  21000.000000
75%    34.250000  25500.000000
max    40.000000  40000.000000

# indexing and slicing

In [11]:
dataframe1["İSİM"]

0       Kaan
1      Murat
2     Andrew
3     Mikail
4    Natalie
5     Brooke
6     Sandra
7    Adriana
Name: İSİM, dtype: object

dataframe verileri her zaman indeksli olarak verilir. indexleri manipüle etmek ayrı bir iştir.

In [12]:
dataframe1["YAŞ"]

0    24
1    24
2    40
3    28
4    28
5    32
6    34
7    35
Name: YAŞ, dtype: int64

In [13]:
dataframe1.YAŞ

0    24
1    24
2    40
3    28
4    28
5    32
6    34
7    35
Name: YAŞ, dtype: int64

var olan df ye yeni veri eklemek

In [14]:
dataframe1["new feature"] = [1, 2, 3, 4, 5, 6, 7, 8]
dataframe1

      İSİM  YAŞ   MAAS  new feature
0     Kaan   24  10000            1
1    Murat   24  10000            2
2   Andrew   40  40000            3
3   Mikail   28  18000            4
4  Natalie   28  12000            5
5   Brooke   32  24000            6
6   Sandra   34  24000            7
7  Adriana   35  30000            8

In [15]:
# dataframe1.new feature

sütun ismi bu şekilde olsa da arada boşluk bırakarak atring tanımlanmadığı için .new feature  hata verecektir. Bu sebepler yeni bir özellik tanımlarken iki kelimeden oluşyorsa ya alt çizgi kullanılması önerilir ya da yeniFeature gibi arada boşluk bırakmadan yazılması önerilir.

# .loc[]

.loc[]  location anlamındadır. Daha sonra .iloc[] göreceğiz. iloc' ta integer LOC anlamındadır.

In [16]:
dataframe1.loc[:, "YAŞ"] #tüm satırları aldık ve istenen sütunu aldık.

0    24
1    24
2    40
3    28
4    28
5    32
6    34
7    35
Name: YAŞ, dtype: int64

In [17]:
dataframe1.loc[:3, "YAŞ"]

0    24
1    24
2    40
3    28
Name: YAŞ, dtype: int64

:3 ile 3' e kadar çağırdık fakat önemli bir ayrıntı. list veri tipinde ve numpy da son indis değeri exclusive yani dahil değildi. Fakat pandas da bu inclusive' dir yani dahildir. Bu nedenle de dikkat edilirse 3. indisi de aldı.

In [18]:
dataframe1.loc[:3, "İSİM":"MAAS"] #ilk dört satır ve İSİM' den MAAS' a kadar olan data

     İSİM  YAŞ   MAAS
0    Kaan   24  10000
1   Murat   24  10000
2  Andrew   40  40000
3  Mikail   28  18000

In [19]:
dataframe1.loc[::-1,:]

      İSİM  YAŞ   MAAS  new feature
7  Adriana   35  30000            8
6   Sandra   34  24000            7
5   Brooke   32  24000            6
4  Natalie   28  12000            5
3   Mikail   28  18000            4
2   Andrew   40  40000            3
1    Murat   24  10000            2
0     Kaan   24  10000            1

In [20]:
dataframe1.loc[:, : "MAAS"] # Tüm satırlar ve MAAS dahil tüm sütunlar

      İSİM  YAŞ   MAAS
0     Kaan   24  10000
1    Murat   24  10000
2   Andrew   40  40000
3   Mikail   28  18000
4  Natalie   28  12000
5   Brooke   32  24000
6   Sandra   34  24000
7  Adriana   35  30000

In [21]:
dataframe1.loc[:, "İSİM"]

0       Kaan
1      Murat
2     Andrew
3     Mikail
4    Natalie
5     Brooke
6     Sandra
7    Adriana
Name: İSİM, dtype: object

In [22]:
dataframe1.iloc[:, 0] #İSİM sütunu, sıfırıncı sütun. iloc ile sütun nosu girerek çağırdık.

0       Kaan
1      Murat
2     Andrew
3     Mikail
4    Natalie
5     Brooke
6     Sandra
7    Adriana
Name: İSİM, dtype: object

# Filtering (Filtreleme)

DataFrame verilerini boolean veri tipinde işlemek mümkündür. (True / False) Böylece belirli kurallar dahilinde veriyi filtre etmek mümkün olacaktır.

In [23]:
# Örneğin, maaşı 15000 liranın üzerinde olan kişileri bulalım (dataframe1' den)

In [24]:
dataframe1

      İSİM  YAŞ   MAAS  new feature
0     Kaan   24  10000            1
1    Murat   24  10000            2
2   Andrew   40  40000            3
3   Mikail   28  18000            4
4  Natalie   28  12000            5
5   Brooke   32  24000            6
6   Sandra   34  24000            7
7  Adriana   35  30000            8

In [25]:
filter1 = dataframe1.MAAS > 15000
filter1

0    False
1    False
2     True
3     True
4    False
5     True
6     True
7     True
Name: MAAS, dtype: bool

In [26]:
type(filter1)

pandas.core.series.Series

In [27]:
filtered_data = dataframe1[filter1]
filtered_data

      İSİM  YAŞ   MAAS  new feature
2   Andrew   40  40000            3
3   Mikail   28  18000            4
5   Brooke   32  24000            6
6   Sandra   34  24000            7
7  Adriana   35  30000            8

In [28]:
# maaşı 15000' in üzerinde olan ve yaşı 35' in üstünde olanları filtreleyebilir miyiz ?

In [29]:
filter2 = dataframe1.YAŞ > 35
filter2

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
Name: YAŞ, dtype: bool

In [30]:
filtered_data2 = dataframe1[filter2]
filtered_data2

     İSİM  YAŞ   MAAS  new feature
2  Andrew   40  40000            3

In [31]:
dataframe1[filter1 & filter2] # and veya or mantık operatörü kullanılamaz, and için & ve or için

     İSİM  YAŞ   MAAS  new feature
2  Andrew   40  40000            3

In [32]:
dataframe1[dataframe1.YAŞ > 40]

Empty DataFrame
Columns: [İSİM, YAŞ, MAAS, new feature]
Index: []

In [33]:
# | = or operatörü alt gr + tire

In [34]:
dataframe1

      İSİM  YAŞ   MAAS  new feature
0     Kaan   24  10000            1
1    Murat   24  10000            2
2   Andrew   40  40000            3
3   Mikail   28  18000            4
4  Natalie   28  12000            5
5   Brooke   32  24000            6
6   Sandra   34  24000            7
7  Adriana   35  30000            8

In [35]:
filter3 = dataframe1.YAŞ < 30
filter4 = dataframe1.MAAS > 10000

In [36]:
dataframe1[filter3 | filter4]

      İSİM  YAŞ   MAAS  new feature
0     Kaan   24  10000            1
1    Murat   24  10000            2
2   Andrew   40  40000            3
3   Mikail   28  18000            4
4  Natalie   28  12000            5
5   Brooke   32  24000            6
6   Sandra   34  24000            7
7  Adriana   35  30000            8

In [37]:
dataframe1[filter3 & filter4]

      İSİM  YAŞ   MAAS  new feature
3   Mikail   28  18000            4
4  Natalie   28  12000            5

In [38]:
df = dataframe1
df

      İSİM  YAŞ   MAAS  new feature
0     Kaan   24  10000            1
1    Murat   24  10000            2
2   Andrew   40  40000            3
3   Mikail   28  18000            4
4  Natalie   28  12000            5
5   Brooke   32  24000            6
6   Sandra   34  24000            7
7  Adriana   35  30000            8

In [39]:
df.MAAS

0    10000
1    10000
2    40000
3    18000
4    12000
5    24000
6    24000
7    30000
Name: MAAS, dtype: int64

In [40]:
# .mean()   ortalama, bu metot, pandasa özgüdür. numpy daki mean kullanmak için np.mean(ortalaması istenen)

In [41]:
ort_maas = df.MAAS.mean()
ort_maas

21000.0

In [42]:
print("Çalışanların ortalama maaşı {}' dır.".format(df.MAAS.mean()))

Çalışanların ortalama maaşı 21000.0' dır.

In [43]:
import numpy as np

In [44]:
ort_maas_from_np = np.mean(df.MAAS)
ort_maas_from_np

21000.0

In [45]:
for i in df.MAAS:
    print(i)

10000
10000
40000
18000
12000
24000
24000
30000

In [46]:
for i in df.MAAS:
    if(i > ort_maas):
        print("yüksek")
    else:
        print("düşük")

düşük
düşük
yüksek
düşük
düşük
yüksek
yüksek
yüksek

In [47]:
df["maas_seviyesi"] = ["yüksek" if i > ort_maas else "düşük" for i in df.MAAS]
df

      İSİM  YAŞ   MAAS  new feature maas_seviyesi
0     Kaan   24  10000            1         düşük
1    Murat   24  10000            2         düşük
2   Andrew   40  40000            3        yüksek
3   Mikail   28  18000            4         düşük
4  Natalie   28  12000            5         düşük
5   Brooke   32  24000            6        yüksek
6   Sandra   34  24000            7        yüksek
7  Adriana   35  30000            8        yüksek

In [48]:
df.columns

Index(['İSİM', 'YAŞ', 'MAAS', 'new feature', 'maas_seviyesi'], dtype='object')

In [49]:
df.columns = [i for i in df.columns]
df

      İSİM  YAŞ   MAAS  new feature maas_seviyesi
0     Kaan   24  10000            1         düşük
1    Murat   24  10000            2         düşük
2   Andrew   40  40000            3        yüksek
3   Mikail   28  18000            4         düşük
4  Natalie   28  12000            5         düşük
5   Brooke   32  24000            6        yüksek
6   Sandra   34  24000            7        yüksek
7  Adriana   35  30000            8        yüksek

In [50]:
df.columns = [i.lower() for i in df.columns]
df

    i̇si̇m  yaş   maas  new feature maas_seviyesi
0     Kaan   24  10000            1         düşük
1    Murat   24  10000            2         düşük
2   Andrew   40  40000            3        yüksek
3   Mikail   28  18000            4         düşük
4  Natalie   28  12000            5         düşük
5   Brooke   32  24000            6        yüksek
6   Sandra   34  24000            7        yüksek
7  Adriana   35  30000            8        yüksek

Buna neden ihtiyaç olur ? Çalışılacak veri setlerinin sütun isimleri o kadar karmaşık olabilir ki böyle durumlarda karmaşayı önlemek amacıyla bu tip yöntemler uygulanabilir.

In [51]:
df.columns

Index(['i̇si̇m', 'yaş', 'maas', 'new feature', 'maas_seviyesi'], dtype='object')

In [52]:
df.columns = [i.split()[0] + "_" + i.split()[1] if (len(i.split()) > 1) else i for i in df.columns]
df.columns

Index(['i̇si̇m', 'yaş', 'maas', 'new_feature', 'maas_seviyesi'], dtype='object')

In [53]:
df

    i̇si̇m  yaş   maas  new_feature maas_seviyesi
0     Kaan   24  10000            1         düşük
1    Murat   24  10000            2         düşük
2   Andrew   40  40000            3        yüksek
3   Mikail   28  18000            4         düşük
4  Natalie   28  12000            5         düşük
5   Brooke   32  24000            6        yüksek
6   Sandra   34  24000            7        yüksek
7  Adriana   35  30000            8        yüksek

# .split()

In [56]:
u = "Mareşal Gazi Mustafa Kemal Atatürk"
u

'Mareşal Gazi Mustafa Kemal Atatürk'

In [57]:
u.split()

['Mareşal', 'Gazi', 'Mustafa', 'Kemal', 'Atatürk']

In [58]:
for i in u.split():
    print(i)

Mareşal
Gazi
Mustafa
Kemal
Atatürk

# drop and concatenating  (düşürme ve birleştirme)

axis = 1 sütunu, asiz = 0 satırı drop eder.

In [59]:
df

    i̇si̇m  yaş   maas  new_feature maas_seviyesi
0     Kaan   24  10000            1         düşük
1    Murat   24  10000            2         düşük
2   Andrew   40  40000            3        yüksek
3   Mikail   28  18000            4         düşük
4  Natalie   28  12000            5         düşük
5   Brooke   32  24000            6        yüksek
6   Sandra   34  24000            7        yüksek
7  Adriana   35  30000            8        yüksek

In [60]:
df.drop(["new_feature"], axis = 1)

    i̇si̇m  yaş   maas maas_seviyesi
0     Kaan   24  10000         düşük
1    Murat   24  10000         düşük
2   Andrew   40  40000        yüksek
3   Mikail   28  18000         düşük
4  Natalie   28  12000         düşük
5   Brooke   32  24000        yüksek
6   Sandra   34  24000        yüksek
7  Adriana   35  30000        yüksek

In [61]:
df  # sildiğimiz sütun kalıcı olmadı.

    i̇si̇m  yaş   maas  new_feature maas_seviyesi
0     Kaan   24  10000            1         düşük
1    Murat   24  10000            2         düşük
2   Andrew   40  40000            3        yüksek
3   Mikail   28  18000            4         düşük
4  Natalie   28  12000            5         düşük
5   Brooke   32  24000            6        yüksek
6   Sandra   34  24000            7        yüksek
7  Adriana   35  30000            8        yüksek

In [62]:
df.drop(["new_feature"], axis = 1, inplace = True)

In [63]:
df  #inplace = true ile kalıcı olarak sildik !

    i̇si̇m  yaş   maas maas_seviyesi
0     Kaan   24  10000         düşük
1    Murat   24  10000         düşük
2   Andrew   40  40000        yüksek
3   Mikail   28  18000         düşük
4  Natalie   28  12000         düşük
5   Brooke   32  24000        yüksek
6   Sandra   34  24000        yüksek
7  Adriana   35  30000        yüksek

In [70]:
data1 = df.head()
data1

    i̇si̇m  yaş   maas maas_seviyesi
0     Kaan   24  10000         düşük
1    Murat   24  10000         düşük
2   Andrew   40  40000        yüksek
3   Mikail   28  18000         düşük
4  Natalie   28  12000         düşük

In [71]:
data2 = df.tail()
data2

    i̇si̇m  yaş   maas maas_seviyesi
3   Mikail   28  18000         düşük
4  Natalie   28  12000         düşük
5   Brooke   32  24000        yüksek
6   Sandra   34  24000        yüksek
7  Adriana   35  30000        yüksek

In [72]:
data_v_concat = pd.concat([data1, data2],axis=0)
data_v_concat

    i̇si̇m  yaş   maas maas_seviyesi
0     Kaan   24  10000         düşük
1    Murat   24  10000         düşük
2   Andrew   40  40000        yüksek
3   Mikail   28  18000         düşük
4  Natalie   28  12000         düşük
3   Mikail   28  18000         düşük
4  Natalie   28  12000         düşük
5   Brooke   32  24000        yüksek
6   Sandra   34  24000        yüksek
7  Adriana   35  30000        yüksek

In [74]:
data_h_concat2 = pd.concat([df.maas, df.yaş],axis=1)
data_h_concat2

    maas  yaş
0  10000   24
1  10000   24
2  40000   40
3  18000   28
4  12000   28
5  24000   32
6  24000   34
7  30000   35

# transforming data

In [80]:
df["zamlı_maas"] = [ 1/2 * i + i  for i in df.maas]
df

    i̇si̇m  yaş   maas maas_seviyesi  zamlı_maas
0     Kaan   24  10000         düşük     15000.0
1    Murat   24  10000         düşük     15000.0
2   Andrew   40  40000        yüksek     60000.0
3   Mikail   28  18000         düşük     27000.0
4  Natalie   28  12000         düşük     18000.0
5   Brooke   32  24000        yüksek     36000.0
6   Sandra   34  24000        yüksek     36000.0
7  Adriana   35  30000        yüksek     45000.0

# .apply()

In [83]:
def multiply(maas):
    return maas/2 + maas

df["apply_metot"] = df.maas.apply(multiply)
df

    i̇si̇m  yaş   maas maas_seviyesi  zamlı_maas  apply_metot
0     Kaan   24  10000         düşük     15000.0      15000.0
1    Murat   24  10000         düşük     15000.0      15000.0
2   Andrew   40  40000        yüksek     60000.0      60000.0
3   Mikail   28  18000         düşük     27000.0      27000.0
4  Natalie   28  12000         düşük     18000.0      18000.0
5   Brooke   32  24000        yüksek     36000.0      36000.0
6   Sandra   34  24000        yüksek     36000.0      36000.0
7  Adriana   35  30000        yüksek     45000.0      45000.0

In [84]:
import numpy as np

def log(apply_metot):
    return np.log(apply_metot)

df["log_maas"] = df.maas.apply(log)
df

    i̇si̇m  yaş   maas maas_seviyesi  zamlı_maas  apply_metot   log_maas
0     Kaan   24  10000         düşük     15000.0      15000.0   9.210340
1    Murat   24  10000         düşük     15000.0      15000.0   9.210340
2   Andrew   40  40000        yüksek     60000.0      60000.0  10.596635
3   Mikail   28  18000         düşük     27000.0      27000.0   9.798127
4  Natalie   28  12000         düşük     18000.0      18000.0   9.392662
5   Brooke   32  24000        yüksek     36000.0      36000.0  10.085809
6   Sandra   34  24000        yüksek     36000.0      36000.0  10.085809
7  Adriana   35  30000        yüksek     45000.0      45000.0  10.308953